---
kind: method
id: M:Autodesk.Revit.DB.TilePatterns.GetTilePattern(Autodesk.Revit.DB.TilePatternsBuiltIn)
source: html/291efd44-998c-12be-8dfc-87716e67f143.htm
---
# Autodesk.Revit.DB.TilePatterns.GetTilePattern Method

Retrieve a TilePattern object from a built-in type.

## Syntax (C#)
```csharp
public TilePattern GetTilePattern(
	TilePatternsBuiltIn tilePatternBuiltIn
)
```

## Parameters
- **tilePatternBuiltIn** (`Autodesk.Revit.DB.TilePatternsBuiltIn`)

## Returns
A TilePattern object, or Nothing nullptr a null reference ( Nothing in Visual Basic) if the document is not a
Massing Family.